{
    "zh-CN": {
        "page-title": "腾龙娱乐 - 官方在线娱乐平台",
        "meta-description": "腾龙娱乐官方平台，提供各种精彩的在线娱乐游戏，例如体育博彩、真人娱乐、电子游戏等。安全可靠，立即加入！",
        "site-title": "腾龙娱乐",
        "about-us": "关于腾龙",
        "login-a": "登陆入口A",
        "agent-portal": "官方代理入口",
        "login-b": "登陆入口B",
        "hero-title": "开启您的娱乐之旅",
        "hero-subtitle": "在这里体验前所未有的刺激和精彩！",
        "feedback-button": "提交反馈",
        "about-title": "关于腾龙",
        "about-content": "我们致力于提供最好的在线娱乐体验，包括各种精彩的体育博彩、真人娱乐和电子游戏。我们拥有安全可靠的平台，并提供24/7的客户服务。腾龙娱乐拥有多年的行业经验，致力于为玩家打造一个公平、公正、安全的游戏环境。我们提供多种便捷的支付方式，并定期推出各种优惠活动。立即加入，开启您的娱乐之旅！",
        "games-title": "热门游戏推荐",
        "sports-betting-title": "体育博彩",
        "sports-betting-desc": "实时赛事直播，多种玩法任选，体验竞技激情！",
        "live-casino-title": "真人娱乐",
        "live-casino-desc": "高清直播互动，真实荷官在线，还原赌场体验！",
        "electronic-games-title": "电子游戏",
        "electronic-games-desc": "海量精品游戏，创新玩法不断，挑战丰厚奖励！",
        "privacy-policy": "隐私政策",
        "terms-of-use": "使用条款",
        "customer-service": "客服中心",
        "copyright": "© 2025 腾龙娱乐. 版权所有."
    },
    "en": {
        "page-title": "Tenglong Entertainment - Official Online Entertainment Platform",
        "meta-description": "Tenglong Entertainment official platform offers various exciting online entertainment games such as sports betting, live casino, electronic games, and more. Safe, reliable, join now!",
        "site-title": "Tenglong Entertainment",
        "about-us": "About Tenglong",
        "login-a": "Login Portal A",
        "agent-portal": "Official Agent Portal",
        "login-b": "Login Portal B",
        "hero-title": "Start Your Entertainment Journey",
        "hero-subtitle": "Experience unprecedented excitement and thrill here!",
        "feedback-button": "Submit Feedback",
        "about-title": "About Tenglong",
        "about-content": "We are committed to providing the best online entertainment experience, including various exciting sports betting, live casino, and electronic games. We have a safe and reliable platform and provide 24/7 customer service. Tenglong Entertainment has many years of industry experience and is committed to creating a fair, just, and secure gaming environment for players. We offer a variety of convenient payment methods and regularly launch various promotional activities. Join now and start your entertainment journey!",
        "games-title": "Popular Game Recommendations",
        "sports-betting-title": "Sports Betting",
        "sports-betting-desc": "Live event streaming, multiple ways to play, experience the thrill of competition!",
        "live-casino-title": "Live Casino",
        "live-casino-desc": "High-definition live interaction, real dealers online, recreating the casino experience!",
        "electronic-games-title": "Electronic Games",
        "electronic-games-desc": "Massive selection of quality games, constantly innovating gameplay, challenge for generous rewards!",
        "privacy-policy": "Privacy Policy",
        "terms-of-use": "Terms of Use",
        "customer-service": "Customer Service",
        "copyright": "© 2025 Tenglong Entertainment. All Rights Reserved."
    },
    "th": {
        "page-title": "เทงหลงเอ็นเตอร์เทนเมนท์ - แพลตฟอร์มความบันเทิงออนไลน์อย่างเป็นทางการ",
        "meta-description": "แพลตฟอร์มอย่างเป็นทางการของเทงหลงเอ็นเตอร์เทนเมนท์นำเสนอเกมความบันเทิงออนไลน์ที่น่าตื่นเต้นหลากหลาย เช่น การเดิมพันกีฬา คาสิโนสด เกมอิเล็กทรอนิกส์ และอื่นๆ ปลอดภัย เชื่อถือได้ เข้าร่วมเลย!",
        "site-title": "เทงหลงเอ็นเตอร์เทนเมนท์",
        "about-us": "เกี่ยวกับเทงหลง",
        "login-a": "ทางเข้าสู่ระบบ A",
        "agent-portal": "พอร์ทัลตัวแทนอย่างเป็นทางการ",
        "login-b": "ทางเข้าสู่ระบบ B",
        "hero-title": "เริ่มต้นการเดินทางแห่งความบันเทิงของคุณ",
        "hero-subtitle": "สัมผัสความตื่นเต้นและความเร้าใจที่ไม่เคยมีมาก่อนที่นี่!",
        "feedback-button": "ส่งข้อเสนอแนะ",
        "about-title": "เกี่ยวกับเทงหลง",
        "about-content": "เรามุ่งมั่นที่จะมอบประสบการณ์ความบันเทิงออนไลน์ที่ดีที่สุด รวมถึงการเดิมพันกีฬาที่น่าตื่นเต้น คาสิโนสด และเกมอิเล็กทรอนิกส์ต่างๆ เรามีแพลตฟอร์มที่ปลอดภัยและเชื่อถือได้ และให้บริการลูกค้าตลอด 24 ชั่วโมงทุกวัน เทงหลงเอ็นเตอร์เทนเมนท์มีประสบการณ์ในอุตสาหกรรมมาหลายปี และมุ่งมั่นที่จะสร้างสภาพแวดล้อมการเล่นเกมที่ยุติธรรม ยุติธรรม และปลอดภัยสำหรับผู้เล่น เรามีวิธีการชำระเงินที่สะดวกสบายหลากหลายรูปแบบ และจัดกิจกรรมส่งเสริมการขายต่างๆ เป็นประจำ เข้าร่วมตอนนี้และเริ่มต้นการเดินทางแห่งความบันเทิงของคุณ!",
        "games-title": "เกมยอดนิยมแนะนำ",
        "sports-betting-title": "การเดิมพันกีฬา",
        "sports-betting-desc": "สตรีมมิ่งการแข่งขันสด รูปแบบการเล่นที่หลากหลาย สัมผัสความตื่นเต้นของการแข่งขัน!",
        "live-casino-title": "คาสิโนสด",
        "live-casino-desc": "การโต้ตอบสดแบบ HD ดีลเลอร์จริงออนไลน์ สร้างประสบการณ์คาสิโนขึ้นมาใหม่!",
        "electronic-games-title": "เกมอิเล็กทรอนิกส์",
        "electronic-games-desc": "เกมคุณภาพมากมาย นวัตกรรมการเล่นเกมอย่างต่อเนื่อง ท้าทายเพื่อรับรางวัลมากมาย!",
        "privacy-policy": "นโยบายความเป็นส่วนตัว",
        "terms-of-use": "ข้อกำหนดการใช้งาน",
        "customer-service": "ศูนย์บริการลูกค้า",
        "copyright": "© 2025 เทงหลงเอ็นเตอร์เทนเมนท์ สงวนลิขสิทธิ์."
    }
}
